/*
 *    반복문 => 반복적인 소스를 모아 한번에 처리
 *    -------------------------------
 *    for(시작값;끝나는값;증가식)
 *    
 *    1~100
 *    for(int i=1,i<=100;i++)
 *    
 *    =>합,곱,개수
 *     sum+=i =>sum=0 (총 구매액)
 *     gop*=i =>gop=1
 *     count++ =>count=0 (구매개수) ==>브라우저로 전송(받은 값 출력),모바일로 전송
 *     request.setAttribute("total",10000)                ---------- 
 *                                                    {"total":10000}
 *    => count=>추천(네이버,카카오)                                         
 *    
 *    ***변수 => 초기값
 *    ***연산자
 *    ***제어문
 *    -------------메소드(여러개=>클래스)=>암기(라이브러리)                                          
 *   형식)
 *      for(시작값;범뮈(끝);증가식)
 *      {
 *         반복실행문장
 *      }
 *      
 *      while:무한루프(종료하지 않는 프로그램)=>while(true):종료하는 프로그램을 첨부
 *                                     게임:ESC=>System.exit
 *           =>데이터베이스(핵심)=>80%
 *      형식)
 *         초기값
 *         while(조건식) ===>false 종료
 *         {
 *             반복수행문장
 *             증가식 ====> 수행 후 조건식 이동
 *         }
 *         
 *         156p~157p 이미지
 *         156p 형식
 *         167p while(형식,순서)
 */
public class 반복문정리 {

	public static void main(String[] args) {
		// TODO Auto-generated method stub
		
	}

}
